OdDAI.AggrOrdered.getValueBoundByIndex(System.Int32)
\details
Get value bound.
\param index [in] an index of value.

OdDAI.AggrOrdered.createAggrInstanceByIndex(System.Int32,OdDAI.Aggr**!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Creates a child aggregate by index.
\param index [in] an index where aggregate create to.
\param newAggr [in/out] output parameter. If succeeded it should filled by a pointer of new child agggregate.